7Ji/esp8266-temp-monitor-and-pc-reset/src/main.cpp
#include <Arduino.h>
#include <DHT.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>

static_assert(sizeof(unsigned long) == sizeof(uint32_t), "unsigned long (would return by millis) is not 32 bit");

#include "root.html.h"

#define COMPCONST static inline constexpr

COMPCONST char const ConfigHostName[] = PRIVATE_HOSTNAME;
COMPCONST char const ConfigWiFiSSID[] = PRIVATE_WIFI_SSID;
COMPCONST char const ConfigWiFiPassword[] = PRIVATE_WIFI_PASSWORD;
COMPCONST unsigned long const ConfigBaudRate = 115200;

COMPCONST char const ErrorStringWouldTruncate[] PROGMEM = "String Would Truncate";
COMPCONST char const ErrorStringFormatFailure[] PROGMEM = "String Format Failure";
COMPCONST char const ErrorNotFound[] PROGMEM = "Not Found";
COMPCONST char const PcPowerOk[] PROGMEM = "Power button pulse sent";
COMPCONST char const PcResetOk[] PROGMEM = "Reset button pulse sent";

COMPCONST unsigned long const OneSecondAsMs = 1'000;
COMPCONST uint8_t const MaxWaits = 20;
COMPCONST uint8_t const PcPinPower =
#ifdef PRIVATE_PIN_POWER
PRIVATE_PIN_POWER
#else
D1
#endif
;
COMPCONST uint8_t const PcPinReset =
#ifdef PRIVATE_PIN_RESET
PRIVATE_PIN_RESET
#else
D2
#endif
;
static DHT dht(
#ifdef PRIVATE_PIN_DHT11
PRIVATE_PIN_DHT11
#else
D4
#endif
, DHT11);
static ESP8266WebServer server(80);

#define serverSendError(x) server.send_P(500, "text/plain", Error ## x, sizeof(Error ## x) - 1)

struct UpTimer {
  COMPCONST uint32_t const MillisSafeMax = UINT32_MAX - OneSecondAsMs;

  uint32_t secondsOffset = 0;
  uint32_t millisOffset = 0;
  uint32_t millisLast = 0;

  uint32_t currentMillis() {
    uint32_t const millisCurrent = millis();

    if (millisCurrent < millisLast) { /* overflow */
      /* UINT32_MAX = 0xFFFFFFFF = 4294967295 */
      secondsOffset += 4294967;
      millisOffset += 295;
      while (millisOffset >= OneSecondAsMs) {
        millisOffset -= OneSecondAsMs;
        secondsOffset += 1;
      }
    }
    millisLast = millisCurrent;
    return millisCurrent;
  }

  uint32_t upSeconds(uint32_t const millisCurrent) const {
    return secondsOffset + (millisCurrent + (millisCurrent > MillisSafeMax ? 0 : millisOffset)) / OneSecondAsMs;
  }
};

static UpTimer upTimer = {};

struct NtpSyncer {
  COMPCONST uint32_t const MinInterval = 3600000UL;
  COMPCONST uint32_t const NtpUnixOffset = 2208988800UL;
  COMPCONST uint32_t const MinUnixOffset = 1776133834UL; /* Tue Apr 14 11:00:01 CST 2026, no specific reason */
  COMPCONST uint32_t const MinNtp = NtpUnixOffset + MinUnixOffset;
  COMPCONST size_t const BufferSize = 48;
  COMPCONST uint16_t const NtpPortRemote = 123;
  COMPCONST uint8_t const OffsetSecs = 40;
  COMPCONST uint8_t const OffsetFrac = 44;
  COMPCONST byte const NtpMagic = 0b11100011;

  COMPCONST char NtpServer[] =
#ifdef PRIVATE_NTP_SERVER
    PRIVATE_NTP_SERVER
#else
    "pool.ntp.org"
#endif
      ;
  COMPCONST uint16_t const NtpPortLocal =
#ifdef PRIVATE_NTP_LOCAL_PORT
    PRIVATE_NTP_LOCAL_PORT
#else
    7931 /* This is chosen simply randomly */
#endif
      ;

  IPAddress serverIP;
  WiFiUDP udp;
  byte buffer[BufferSize];
  uint32_t millisLast;
  uint32_t requestToken = 0;
  bool init, isIP;

  uint64_t unixOffset = MinUnixOffset;
  uint64_t unixLast = MinUnixOffset;

  static uint32_t BEu32At(byte const *const data) {
    return (uint32_t(data[0]) << 24) |
           (uint32_t(data[1]) << 16) |
           (uint32_t(data[2]) << 8) |
            uint32_t(data[3]);
  }

  static void BEu32To(byte *const data, uint32_t const value) {
    data[0] = value >> 24;
    data[1] = value >> 16;
    data[2] = value >> 8;
    data[3] = value;
  }

  void discard(size_t size) {
    int discarded;

    while (size > 0) {
      discarded = udp.read(buffer, size > BufferSize ? BufferSize : size);
      if (discarded <= 0 || size_t(discarded) >= size) {
        return;
      }
      size -= discarded;
    }
  }

  void update(uint32_t millisCurrent) {
    uint8_t i;
    uint32_t ntpOffset, requestSecs, requestFrac;
    uint64_t candidateUnixNow;
    int packetSize;

    if (!init) {
      if (!udp.begin(NtpPortLocal)) {
        Serial.printf("Failed to listen on %" PRIu16 "\n", NtpPortLocal);
        return;
      }
      if (serverIP.fromString(NtpServer)) {
        isIP = true;
      }
      init = true;
    }
    if (!isIP) {
      if (!WiFi.hostByName(NtpServer, serverIP, 1000)) {
        Serial.printf("Failed to resolve '%s' to IP\n", NtpServer);
        return;
      }
    }
    /* discard pending packets */
    while ((packetSize = udp.parsePacket()) > 0) {
      discard(packetSize);
    }
    if (!udp.beginPacket(serverIP, NtpPortRemote)) {
      Serial.println("Failed to begin NTP packet");
      return;
    }
    buffer[0] = NtpMagic;
    memset(buffer + 1, 0, BufferSize - 1);
    requestSecs = ++requestToken;
    requestFrac = millisCurrent;
    BEu32To(buffer + OffsetSecs, requestSecs);
    BEu32To(buffer + OffsetFrac, requestFrac);
    if (udp.write(buffer, BufferSize) != BufferSize) {
      Serial.println("Failed to write whole NTP packet");
      return;
    }
    if (!udp.endPacket()) {
      Serial.println("Failed to end UDP packet");
      return;
    }
    for (i = 0;;) {
      packetSize = udp.parsePacket();
      if (packetSize > 0) {
        if (size_t(packetSize) < BufferSize) {
          Serial.printf("Ignoring short NTP response of %d bytes\n", packetSize);
          discard(packetSize);
          continue;
        }
        if (udp.read(buffer, BufferSize) != BufferSize) {
          Serial.println("Failed to read NTP response");
          if (size_t(packetSize) > BufferSize) {
            discard(packetSize - BufferSize);
          }
          return;
        }
        if (size_t(packetSize) > BufferSize) {
          discard(packetSize - BufferSize);
        }
        if (udp.remotePort() != NtpPortRemote || udp.remoteIP() != serverIP) {
          Serial.println("Ignoring NTP response from unexpected peer");
          continue;
        }
        if (BEu32At(buffer + 24) != requestSecs || BEu32At(buffer + 28) != requestFrac) {
          Serial.println("Ignoring stale NTP response");
          continue;
        }
        break;
      }
      delay(100);
      if (++i > 20) {
        Serial.println("Timeout waiting for NTP response");
        return;
      }
    }
    millisCurrent = upTimer.currentMillis();
    ntpOffset = BEu32At(buffer + OffsetSecs);

    candidateUnixNow = ntpOffset - NtpUnixOffset;
    if (ntpOffset < MinNtp) {
      Serial.printf("NTP offset %" PRIu32 " < minimum NTP %" PRIu32 ", adding one era\n", ntpOffset, MinNtp);
      candidateUnixNow += 0x100000000ULL;
    }
    if (candidateUnixNow < unixLast) {
      Serial.printf("Ignoring backward unix time %" PRIu64 " < current %" PRIu64 "\n", candidateUnixNow, unixLast);
    } else {
      unixOffset = candidateUnixNow - upTimer.upSeconds(millisCurrent);
      unixLast = candidateUnixNow;
    }
    millisLast = millisCurrent;
    Serial.printf("Current unix time is %" PRIu64 ", unix offset is %" PRIu64 "\n", unixLast, unixOffset);
  }

  void firstUpdate(uint32_t const millisCurrent) {
    update(millisCurrent);
  }

  void observeUnixSeconds(uint64_t const unixSeconds) {
    if (unixSeconds > unixLast) {
      unixLast = unixSeconds;
    }
  }

  uint64_t currentUnixSeconds(uint32_t const millisCurrent) {
    uint64_t const unixSeconds = unixOffset + upTimer.upSeconds(millisCurrent);

    observeUnixSeconds(unixSeconds);
    return unixSeconds;
  }

  void ensureUnixSeconds(uint32_t const millisCurrent, uint64_t const unixSeconds) {
    uint64_t const candidateUnixOffset = unixSeconds - upTimer.upSeconds(millisCurrent);

    if (candidateUnixOffset > unixOffset) {
      Serial.printf("Raising unix offset to recovered floor %" PRIu64 "\n", candidateUnixOffset);
      unixOffset = candidateUnixOffset;
    }
    observeUnixSeconds(unixSeconds);
  }

  void maybeUpdate(uint32_t const millisCurrent) {
    /* Force update if not initialized yet, or */
    if ((millisCurrent - millisLast) >= MinInterval || !init) {
      update(millisCurrent);
    }
  }
};

